## Task 1
def first_two_last_two(s):
  """
  Повертає рядок, що складається з перших 2 та останніх 2 символів заданого рядка.
  Якщо довжина рядка менше 2, повертає порожній рядок.
  Аргументи:
    s: Вхідний рядок.
  Повертає:
    Новий рядок, що складається з перших 2 та останніх 2 символів, або порожній рядок.
  «»"
  """
  # Перевіряємо довжину. Якщо в рядку 0 або 1 символ, повертаємо порожній рядок.
  if len(s) < 2:
    return ""
  else:
      # s[:2]: Беремо перші два символи (позитивна індексація).
      # s[-2:]: Беремо останні два символи (негативна індексація).
    return s[:2] + s[-2:]

# Sample Usage:
print(f"'helloworld' -> '{first_two_last_two('helloworld')}'")
print(f"'my' -> '{first_two_last_two('my')}'")
print(f"'x' -> '{first_two_last_two('x')}'")
print(f"'' -> '{first_two_last_two('')}'")

## Task 2
phone_number = input("Введіть номер телефону: ")

# Перевіряємо, чи складається рядок лише з цифр та чи його довжина рівна 10 ( isdigit() — перевіряє, чи є в рядку лише цифри (без пробілів, тире чи літер).
# len() == 10 — контролює кількість символів.
if phone_number.isdigit() and len(phone_number) == 10:
    print("відповідає формату телефонного номера!")
else:
    print("Помилка: номер має містити рівно 10 цифр і жодних інших символів.")

## Task 3
import random

# Генеруємо два випадкові числа
num1 = random.randint(1, 20)
num2 = random.randint(1, 20)
correct_answer = num1 * num2

# Запитуємо користувача
print(f"Скільки буде {num1} * {num2}?")
user_answer = int(input("Ваша відповідь: "))

# Перевірка результату
if user_answer == correct_answer:
    print("Правильно! Ти молодець! ")
else:
    print(f"Помилка. Правильна відповідь: {correct_answer}. ️")

## Task 4
# Зберігаємо ім'я у нижньому регістрі
my_name = "olena"

# Отримуємо введення від користувача
user_input = input("Як тебе звати? ")

# Порівнюємо, перевівши введене ім'я у нижній регістр
if user_input.lower() == my_name:
    print(True)
else:
    print(False)